<section>
    <div class="container mx-auto max-w-[1300px] py-14 pt-0 lg:pt-[50px] lg:pb-[100px] px-4">
        <div class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-4">
            <div class="block">
                <div class="bg-fill-qt rounded-lg p-8 h-full">
                    <div class="flex justify-center mb-6">
                        <svg class="text-lab-pr2" width="80" height="80" viewBox="0 0 80 80" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
                            <path d="M68.28 12.22L62.64 17.86C68.4 23.66 72 31.66 72 40.5C72 58.18 57.68 72.5 40 72.5C22.32 72.5 8 58.18 8 40.5C8 24.18 20.2 10.74 36 8.78V16.86C24.64 18.78 16 28.62 16 40.5C16 53.74 26.76 64.5 40 64.5C53.24 64.5 64 53.74 64 40.5C64 33.86 61.32 27.86 56.96 23.54L51.32 29.18C54.2 32.1 56 36.1 56 40.5C56 49.34 48.84 56.5 40 56.5C31.16 56.5 24 49.34 24 40.5C24 33.06 29.12 26.86 36 25.06V33.62C33.6 35.02 32 37.54 32 40.5C32 44.9 35.6 48.5 40 48.5C44.4 48.5 48 44.9 48 40.5C48 37.54 46.4 34.98 44 33.62V0.5H40C17.92 0.5 0 18.42 0 40.5C0 62.58 17.92 80.5 40 80.5C62.08 80.5 80 62.58 80 40.5C80 29.46 75.52 19.46 68.28 12.22Z" fill="currentColor"/>
                        </svg>
                    </div>
                    <h4 class="text-title-1 font-semibold mb-4 text-center">
                        Устраивай челленджи
                    </h4>
                    <p class="text-par-m">
                        Ставь перед собой важные задачи и поднимай их на принципиальный уровень с помощью челленджей
                    </p>
                </div>
            </div>
            <div class="block">
                <div class="bg-fill-qt rounded-lg p-6 lg:p-8 h-full">
                    <div class="flex justify-center mb-6">
                        <svg class="text-lab-pr2" width="80" height="67" viewBox="0 0 80 67" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
                            <path d="M65.9 9.93333L70.5667 14.6L28.1 57.0667L9.43333 38.4L14.1 33.7333L28.1 47.7333L65.9 9.93333ZM65.9 0.5L28.1 38.3L14.1 24.3L0 38.4L28.1 66.5L80 14.6L65.9 0.5Z" fill="currentColor"/>
                        </svg>
                    </div>
                    <h4 class="text-title-1 font-semibold mb-4 text-center">
                        Вырабатывай привычки
                    </h4>
                    <p class="text-par-m">
                        Создавай и закрепляй привычки, которые способствуют твоему росту и помогают тебе продвигаться к целям 
                    </p>
                </div>
            </div>
            <div class="block">
                <div class="bg-fill-qt rounded-lg p-6 lg:p-8 h-full">
                    <div class="flex justify-center mb-6">
                        <svg class="text-lab-pr2" width="80" height="80" viewBox="0 0 80 80" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_1746_2598)">
                            <path d="M55.0026 15.0999C58.6845 15.0999 61.6693 12.1152 61.6693 8.43327C61.6693 4.75137 58.6845 1.7666 55.0026 1.7666C51.3207 1.7666 48.3359 4.75137 48.3359 8.43327C48.3359 12.1152 51.3207 15.0999 55.0026 15.0999Z" fill="currentColor"/>
                            <path d="M79.9995 40.1V24.4333L63.1661 17.3C59.9328 15.9333 56.1995 17.1 54.3328 20.1L50.9995 25.4333C48.7661 29.3666 44.6328 32.3 39.6328 33.1666L39.8328 33.3666C42.1328 35.6666 44.8995 36.9333 48.0328 37.2666C50.6995 35.8666 53.0995 34 54.9995 31.8L56.9995 41.8L53.1328 45.4666L49.9995 48.4333V50.9666V73.4333H56.6661V53.4333L63.6661 46.7666L69.6661 73.4333H76.6661L69.3995 36.7666L67.3328 26.4333L73.3328 28.7666V40.1H79.9995Z" fill="currentColor"/>
                            <path d="M34.3028 27.4664C35.0361 27.9664 35.8695 28.2664 36.7028 28.433C37.1361 28.4997 37.5361 28.5664 37.9695 28.5664C38.4028 28.5664 38.8361 28.533 39.2361 28.433C39.6695 28.3664 40.0695 28.233 40.4695 28.0664C41.2695 27.733 42.0361 27.2664 42.6695 26.5997C44.3028 24.9664 44.9028 22.6997 44.5028 20.5997C44.2695 19.3664 43.6695 18.133 42.6695 17.1664C42.0361 16.533 41.2695 16.033 40.4695 15.6997C40.0695 15.533 39.6695 15.3997 39.2361 15.333C38.8028 15.2664 38.4028 15.1997 37.9695 15.1997C37.5695 15.1997 37.2028 15.233 36.8028 15.2997C36.3361 15.3664 35.8695 15.4997 35.4361 15.6664C34.6695 16.033 33.9028 16.533 33.2695 17.1664C32.2695 18.133 31.6695 19.3664 31.4361 20.5997C31.0361 22.6997 31.6361 24.9664 33.2695 26.5997C33.5695 26.933 33.9361 27.1997 34.3028 27.4664Z" fill="currentColor"/>
                            <path d="M37.468 35.7001L30.8013 29.0334C30.468 28.7001 30.1346 28.4334 29.768 28.1668C29.0346 27.7001 28.2013 27.3668 27.368 27.2334C26.9346 27.1334 26.5346 27.1001 26.1013 27.1001C24.4013 27.1001 22.7013 27.7668 21.4013 29.0668L10.268 40.2001C8.9013 41.5668 8.2013 43.4668 8.33464 45.3334C8.33464 45.9334 8.46797 46.5668 8.7013 47.1668L12.268 57.0001L0.167969 69.1001L4.86797 73.8334L19.0013 59.7001V52.3001L23.3346 56.3334V73.4334H30.0013V53.4334L22.9346 46.3668L30.8013 38.5001L33.168 40.8668C37.468 45.0668 43.068 47.6668 49.9346 47.6668L49.468 40.7668C44.468 40.7001 40.468 38.7001 37.468 35.7001Z" fill="currentColor"/>
                            </g>
                            <defs>
                            <clipPath id="clip0_1746_2598">
                            <rect width="80" height="80" fill="currentColor" transform="translate(0 0.5)"/>
                            </clipPath>
                            </defs>
                        </svg>
                    </div>
                    <h4 class="text-title-1 font-semibold mb-4 text-center">
                        Устраивай челленджи
                    </h4>
                    <p class="text-par-m">
                        Ставь перед собой важные задачи и поднимай их на принципиальный уровень с помощью челленджей
                    </p>
                </div>
            </div>
            <div class="block">
                <div class="bg-fill-qt rounded-lg p-6 lg:p-8 h-full">
                    <div class="flex justify-center mb-6">
                        <svg class="text-lab-pr2" width="80" height="81" viewBox="0 0 80 81" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_1746_2610)">
                            <path d="M69.9987 15.2998H9.9987C6.33203 15.2998 3.33203 18.2998 3.33203 21.9665V31.9665H9.9987V21.9665H69.9987V68.6331H46.6654V75.2998H69.9987C73.6654 75.2998 76.6654 72.2998 76.6654 68.6331V21.9665C76.6654 18.2998 73.6654 15.2998 69.9987 15.2998ZM3.33203 65.2998V75.2998H13.332C13.332 69.7665 8.86536 65.2998 3.33203 65.2998ZM3.33203 51.9665V58.6331C12.532 58.6331 19.9987 66.0998 19.9987 75.2998H26.6654C26.6654 62.3998 16.232 51.9665 3.33203 51.9665ZM3.33203 38.6331V45.2998C19.8987 45.2998 33.332 58.7331 33.332 75.2998H39.9987C39.9987 55.0331 23.5654 38.6331 3.33203 38.6331ZM36.6654 42.2665V48.9331L48.332 55.2998L59.9987 48.9331V42.2665L48.332 48.6331L36.6654 42.2665ZM48.332 25.2998L29.9987 35.2998L48.332 45.2998L66.6654 35.2998L48.332 25.2998Z" fill="currentColor"/>
                            </g>
                            <defs>
                            <clipPath id="clip0_1746_2610">
                            <rect width="80" height="80" fill="currentColor" transform="translate(0 0.5)"/>
                            </clipPath>
                            </defs>
                        </svg>
                    </div>
                    <h4 class="text-title-1 font-semibold mb-4 text-center">
                        Обучайся
                    </h4>
                    <p class="text-par-m">
                        Получи доступ к нашей базе знаний по личной эффективности, которая постоянно обновляется
                    </p>
                </div>
            </div>
            <div class="block">
                <div class="bg-fill-qt rounded-lg p-6 lg:p-8 h-full">
                    <div class="flex justify-center mb-6">
                        <svg class="text-lab-pr2" width="80" height="81" viewBox="0 0 80 81" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
                            <path d="M40 0.5C17.92 0.5 0 18.42 0 40.5C0 62.58 17.92 80.5 40 80.5C62.08 80.5 80 62.58 80 40.5C80 18.42 62.08 0.5 40 0.5ZM43.52 63.54V68.5H36.52V63.34C33.56 62.62 26.96 60.26 24.44 51.5L31.04 48.82C31.28 49.7 33.36 57.18 40.64 57.18C44.36 57.18 48.56 55.26 48.56 50.74C48.56 46.9 45.76 44.9 39.44 42.62C35.04 41.06 26.04 38.5 26.04 29.38C26.04 28.98 26.08 19.78 36.52 17.54V12.5H43.52V17.46C50.88 18.74 53.56 24.62 54.16 26.38L47.84 29.06C47.4 27.66 45.48 23.7 40.24 23.7C37.44 23.7 33 25.18 33 29.26C33 33.06 36.44 34.5 43.56 36.86C53.16 40.18 55.6 45.06 55.6 50.66C55.6 61.18 45.6 63.18 43.52 63.54Z" fill="currentColor"/>
                        </svg>
                    </div>
                    <h4 class="text-title-1 font-semibold mb-4 text-center">
                        Зарабатывай
                    </h4>
                    <p class="text-par-m">
                    Присоединяйся к нашей выгодной партнерской программе и получай от 25 до 50% от каждой покупки участников, привлеченных по твоей ссылке или промокоду.  <a href="#" class="underline">Подробности</a>
                    </p>
                </div>
            </div>
            <div class="block">
                <div class="bg-fill-qt rounded-lg p-6 lg:p-8 h-full">
                    <div class="flex justify-center mb-6">
                        <svg class="text-lab-pr2" width="62" height="81" viewBox="0 0 62 81" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
                            <path d="M22.1615 45.0333L30.9996 38.3286L39.7996 45.0333L36.4472 34.1762L45.2853 27.1667H34.4663L30.9996 16.4619L27.533 27.1667H16.7139L25.5139 34.1762L22.1615 45.0333ZM61.4758 30.9762C61.4758 14.1381 47.8377 0.5 30.9996 0.5C14.1615 0.5 0.523438 14.1381 0.523438 30.9762C0.523438 38.7095 3.41868 45.719 8.14249 51.0905V80.5L30.9996 72.881L53.8568 80.5V51.0905C58.5806 45.719 61.4758 38.7095 61.4758 30.9762ZM30.9996 8.11905C43.6091 8.11905 53.8568 18.3667 53.8568 30.9762C53.8568 43.5857 43.6091 53.8333 30.9996 53.8333C18.3901 53.8333 8.14249 43.5857 8.14249 30.9762C8.14249 18.3667 18.3901 8.11905 30.9996 8.11905Z" fill="currentColor"/>
                        </svg>
                    </div>
                    <h4 class="text-title-1 font-semibold mb-4 text-center">
                        Пиши свою личную историю успеха
                    </h4>
                    <p class="text-par-m">
                        Все твои достижения фиксируются в твоем профиле. Каждая привычка, каждый челлендж, каждая победа и поражение – всё это навсегда остается в истории. 
                    </p>
                </div>
            </div>
        </div>
    </div>
</section>